MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx350f128l.h
#define _U8932STA_TRMT_POSITION                  0x00000008
#define _U8932STA_TRMT_MASK                      0x00000100
#define _U8932STA_TRMT_LENGTH                    0x00000001

#define _U8932STA_UTXBF_POSITION                 0x00000009
#define _U8932STA_UTXBF_MASK                     0x00000200
#define _U8932STA_UTXBF_LENGTH                   0x00000001

#define _U8932STA_UTXEN_POSITION                 0x0000000A
#define _U8932STA_UTXEN_MASK                     0x00000400
#define _U8932STA_UTXEN_LENGTH                   0x00000001

#define _U8932STA_UTXBRK_POSITION                0x0000000B
#define _U8932STA_UTXBRK_MASK                    0x00000800
#define _U8932STA_UTXBRK_LENGTH                  0x00000001

#define _U8932STA_URXEN_POSITION                 0x0000000C
#define _U8932STA_URXEN_MASK                     0x00001000
#define _U8932STA_URXEN_LENGTH                   0x00000001

#define _U8932STA_UTXINV_POSITION                0x0000000D
#define _U8932STA_UTXINV_MASK                    0x00002000
#define _U8932STA_UTXINV_LENGTH                  0x00000001

#define _U8932STA_UTXISEL_POSITION               0x0000000E
#define _U8932STA_UTXISEL_MASK                   0x0000C000
#define _U8932STA_UTXISEL_LENGTH                 0x00000002

#define _U8932STA_ADDR_POSITION                  0x00000010
#define _U8932STA_ADDR_MASK                      0x00FF0000
#define _U8932STA_ADDR_LENGTH                    0x00000008

#define _U8932STA_ADM_EN_POSITION                0x00000018
#define _U8932STA_ADM_EN_MASK                    0x01000000
#define _U8932STA_ADM_EN_LENGTH                  0x00000001

#define _U8932STA_URXISEL0_POSITION              0x00000006
#define _U8932STA_URXISEL0_MASK                  0x00000040
#define _U8932STA_URXISEL0_LENGTH                0x00000001

#define _U8932STA_URXISEL1_POSITION              0x00000007
#define _U8932STA_URXISEL1_MASK                  0x00000080
#define _U8932STA_URXISEL1_LENGTH                0x00000001

#define _U8932STA_UTXISEL0_POSITION              0x0000000E
#define _U8932STA_UTXISEL0_MASK                  0x00004000
#define _U8932STA_UTXISEL0_LENGTH                0x00000001

#define _U8932STA_UTXISEL1_POSITION              0x0000000F
#define _U8932STA_UTXISEL1_MASK                  0x00008000
#define _U8932STA_UTXISEL1_LENGTH                0x00000001

#define _U8932STA_UTXSEL_POSITION                0x0000000E
#define _U8932STA_UTXSEL_MASK                    0x0000C000
#define _U8932STA_UTXSEL_LENGTH                  0x00000002

#define _U8932STA_w_POSITION                     0x00000000
#define _U8932STA_w_MASK                         0xFFFFFFFF
#define _U8932STA_w_LENGTH                       0x00000020

#define _U39MODE_STSEL_POSITION                  0x00000000
#define _U39MODE_STSEL_MASK                      0x00000001
#define _U39MODE_STSEL_LENGTH                    0x00000001

#define _U39MODE_PDSEL_POSITION                  0x00000001
#define _U39MODE_PDSEL_MASK                      0x00000006
#define _U39MODE_PDSEL_LENGTH                    0x00000002

#define _U39MODE_BRGH_POSITION                   0x00000003
#define _U39MODE_BRGH_MASK                       0x00000008
#define _U39MODE_BRGH_LENGTH                     0x00000001

#define _U39MODE_RXINV_POSITION                  0x00000004
#define _U39MODE_RXINV_MASK                      0x00000010
#define _U39MODE_RXINV_LENGTH                    0x00000001

#define _U39MODE_ABAUD_POSITION                  0x00000005
#define _U39MODE_ABAUD_MASK                      0x00000020
#define _U39MODE_ABAUD_LENGTH                    0x00000001

#define _U39MODE_LPBACK_POSITION                 0x00000006
#define _U39MODE_LPBACK_MASK                     0x00000040
#define _U39MODE_LPBACK_LENGTH                   0x00000001

#define _U39MODE_WAKE_POSITION                   0x00000007
#define _U39MODE_WAKE_MASK                       0x00000080
#define _U39MODE_WAKE_LENGTH                     0x00000001

#define _U39MODE_UEN_POSITION                    0x00000008
#define _U39MODE_UEN_MASK                        0x00000300
#define _U39MODE_UEN_LENGTH                      0x00000002

#define _U39MODE_RTSMD_POSITION                  0x0000000B
#define _U39MODE_RTSMD_MASK                      0x00000800
#define _U39MODE_RTSMD_LENGTH                    0x00000001

#define _U39MODE_IREN_POSITION                   0x0000000C
#define _U39MODE_IREN_MASK                       0x00001000
#define _U39MODE_IREN_LENGTH                     0x00000001

#define _U39MODE_SIDL_POSITION                   0x0000000D
#define _U39MODE_SIDL_MASK                       0x00002000
#define _U39MODE_SIDL_LENGTH                     0x00000001

#define _U39MODE_ON_POSITION                     0x0000000F
#define _U39MODE_ON_MASK                         0x00008000
#define _U39MODE_ON_LENGTH                       0x00000001

#define _U39MODE_PDSEL0_POSITION                 0x00000001
#define _U39MODE_PDSEL0_MASK                     0x00000002
#define _U39MODE_PDSEL0_LENGTH                   0x00000001

#define _U39MODE_PDSEL1_POSITION                 0x00000002
#define _U39MODE_PDSEL1_MASK                     0x00000004
#define _U39MODE_PDSEL1_LENGTH                   0x00000001

#define _U39MODE_UEN0_POSITION                   0x00000008
#define _U39MODE_UEN0_MASK                       0x00000100
#define _U39MODE_UEN0_LENGTH                     0x00000001

#define _U39MODE_UEN1_POSITION                   0x00000009
#define _U39MODE_UEN1_MASK                       0x00000200
#define _U39MODE_UEN1_LENGTH                     0x00000001

#define _U39MODE_USIDL_POSITION                  0x0000000D
#define _U39MODE_USIDL_MASK                      0x00002000
#define _U39MODE_USIDL_LENGTH                    0x00000001

#define _U39MODE_UARTEN_POSITION                 0x0000000F
#define _U39MODE_UARTEN_MASK                     0x00008000
#define _U39MODE_UARTEN_LENGTH                   0x00000001

#define _U39MODE_w_POSITION                      0x00000000
#define _U39MODE_w_MASK                          0xFFFFFFFF
#define _U39MODE_w_LENGTH                        0x00000020

